<!DOCTYPE html>
<html lang="es">

<head>
    <meta charset="utf-8">
    <meta name="description" content="L&iacute;nea del Tiempo de la Web">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="keywords" content="L&iacute;nea, Tiempo, Web">
    <title>1990</title>
    <link rel="icon" href="img/bee.png">
</head>

<body
    style="color:white; font-family: Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif; background-color: #0F2F3C;">
    <header style="height: 30px;">
        <div style="float: left;"><a href="index.html"><img src="img/iconHome.png" height="40px" width="40px"></a></div>
    </header>

    <p>
    <FIELDSET style="border:1px solid #18DF1A">
        <LEGEND ALIGN=CENTER >
            <h2 style="color: #ffffff;">Web 1.0</h2>
        </LEGEND>
        <p ALIGN=CENTER>
            Se considera que en esta d&eacute;cada comenzó oficialmente la Web 1.0. <strong>Web 1.0</strong> se refiere
            a un estado de la
            World Wide Web. Es en general un término usado para describir la Web antes del impacto de la «fiebre punto
            com»
            en el 2001, que es visto por muchos como el momento en que el internet dio un giro.
        </p>
        <p ALIGN=CENTER>
            <img src="img/web1_0.jpeg" height="150px" width="250px">
        </p>
    </FIELDSET>
    </p>

    <p>
    <FIELDSET style="border:1px solid #18DF1A">
        <LEGEND ALIGN=CENTER >
            <h2 style="color: #ffffff;">1990</h2>
        </LEGEND>
        <p ALIGN=CENTER>
            En este año surge el protocolo HTTP. El Protocolo de transferencia de hipertexto (en inglés, Hypertext
            Transfer
            Protocol, abreviado HTTP) es el protocolo de comunicación que permite las transferencias de información a
            través
            de archivos (XHML, HTML…) en la World Wide Web. Fue desarrollado por el World Wide Web Consortium y la
            Internet
            Engineering Task Force.
        </p>
        <p ALIGN=CENTER>
            <img src="img/http.png" height="150px" width="280px">
        </p>
    </FIELDSET>
    </p>

    <p>
    <FIELDSET style="border:1px solid #18DF1A">
        <LEGEND ALIGN=CENTER >
            <h2 style="color: #ffffff;">1991</h2>
        </LEGEND>
        <p ALIGN=CENTER>
            En este año Tim Berners Lee creó la World Wide Web (La Web) o red informática mundial. La WWW es un sistema
            que
            funciona a través de Internet, por el cual se pueden transmitir diversos tipos de datos a través del
            Protocolo
            de Transferencia de Hipertextos o HTTP, que son los enlaces de la página web.
        </p>
        <p ALIGN=CENTER>
            <img src="img/tim_berners_lee.png" height="150px" width="150px">
        </p>
    </FIELDSET>
    </p>

    <p>
    <FIELDSET style="border:1px solid #18DF1A">
        <LEGEND ALIGN=CENTER >
            <h2 style="color: #ffffff;">1993</h2>
        </LEGEND>
        <p ALIGN=CENTER>
            La primera propuesta oficial para convertir HTML en un est&aacute;ndar se realiz&oacute; en 1993 por parte
            del
            organismo IETF (Internet Engineering Task Force).
        </p>
        <p ALIGN=CENTER>
            <a> <img src="img/HTML.png" height="150px" width="150px"></a>
        </p>
    </FIELDSET>
    </p>

    <p>
    <FIELDSET style="border:1px solid #18DF1A">
        <LEGEND ALIGN=CENTER>
            <h2 style="color: #ffffff;">1995</h2>
        </LEGEND>
        <p ALIGN=CENTER>
            En octubre de 1995, la empresa <b>Amazon</b> se anunci&oacute; al p&uacute;blico.
        </p>
        <p ALIGN=CENTER>
            <a href="https://www.amazon.com.mx/ref=nav_logo" target="black"> <img src="img/amazon.png" height="150px"
                    width="276px"></a>
        </p>
    </FIELDSET>
    </p>
    <p>
    <FIELDSET style="border:1px solid #18DF1A">
        <LEGEND ALIGN=CENTER>
            <h2 style="color: #ffffff;">1998</h2>
        </LEGEND>
        <p ALIGN=CENTER>
            Google es uno de los buscadores m&aacute;s conocidos y la fecha exacta de su lanzamiento fue el 4
            de septiembre de 1998. Despu&eacute;s de un a&ntilde;o de duro trabajo, sus creadores, Larry Page y Sergey
            Brin lanzaron al mercado un motor de b&uacute;squeda al que llamaron Google, aunque en 1997 los dos
            j&oacute;venes estudiantes de la Universidad de Stanfors ya hab&iacute;an creado un prototipo de buscador al
            que hab&iacute;an llamado BackRub, pero ese mismo a&ntilde;o, decidieron cambiarle el nombre
            inspir&aacute;ndose en
            el t&eacute;rmino matem&aacute;tico “g&uacute;gol” que hace referencia n&uacute;mero 10 elevado a la
            potencia de 100. No fue
            hasta 1998 cuando estrenaron su motor de b&uacute;squeda y fundaron oficialmente la compa&ntilde;&iacute;a,
            que desde
            sus inicios se caracteriz&oacute; por ser una empresa que prim&oacute; la responsabilidad corporativa, las
            pol&iacute;ticas
            de igualdad y derechos de los empleados y cre&oacute; nuevas formas de trabajo. Tras ese hecho su
            popularidad
            empez&oacute; a crecer notablemente y al poco tiempo ya hab&iacute;a superado a otro de los m&aacute;s
            populares de la &eacute;poca,
            el AltaVista.
        </p>
        <p ALIGN=CENTER>
            <a href="https://es.wikipedia.org/wiki/Google#:~:text=El%20objetivo%20principal%20del%20buscador,y%20Sergey%20Brin%20en%201997."
                target="black"> <img src="img/Google.png" height="150px" width="225px"></a>
        </p>
    </FIELDSET>
    </p>
    <p>
    <FIELDSET style="border:1px solid #18DF1A">
        <LEGEND ALIGN=CENTER>
            <h2 style="color: #ffffff;">1999</h2>
        </LEGEND>
        <p ALIGN=CENTER>
            El t&eacute;rmino fue inventado por Darcy DiNucci en 1999 y luego popularizado por Tim O'Reilly
            y Dale Dougherty, en una conferencia sobre la Web 2.0 de O'Reilly Media en 2004.
        </p>
        <p ALIGN=CENTER>
            <a> <img src="img/darcy.jpg" height="150px" width="267px"></a>
        </p>
    </FIELDSET>
    </p>

    <hr color="#18DF1A" size="2">
    <footer>
        <div style="float: right; height: 20px;"><a style="color: #adff2f; font-size: x-large;" href="contacto.html">Contactos</a></div>
    </footer>
    <br>
    <br>
    <hr color="#18DF1A" size="2">
</body>

</html>